# Dataframe

In [1]:
#pandas dataframe is two dimensional ,size mutable,potentially hetrogenous, tabular data structure with labeled 
#axes rows & column

In [2]:
import pandas as pd

In [4]:
emt_df=pd.DataFrame()
print(emt_df)

Empty DataFrame
Columns: []
Index: []

# dataframe using List

In [5]:
lst=['a','b','c']
print(lst)

['a', 'b', 'c']

In [7]:
df1=pd.DataFrame(lst)
print(df1)

   0
0  a
1  b
2  c

In [8]:
df1  #better visualization

   0
0  a
1  b
2  c

In [9]:
lst_of_lst=[[1,2,3,],[2,3,4],[4,5,6]]
print(lst_of_lst)

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [12]:
df2=pd.DataFrame(lst_of_lst)
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

# dataframe from dictionaries

In [13]:
dict1={'ID':[11,12,33,44]}
dict1

{'ID': [11, 12, 33, 44]}

In [15]:
df3=pd.DataFrame(dict1)
df3
#dataframe with label ID

   ID
0  11
1  12
2  33
3  44

In [19]:
dict1={'ID':[11,12,33,44],'SN':[1,2,3,4]}
dict1

{'ID': [11, 12, 33, 44], 'SN': [1, 2, 3, 4]}

In [20]:
df3=pd.DataFrame(dict1)
df3

   ID  SN
0  11   1
1  12   2
2  33   3
3  44   4

In [22]:
#list of dictionaries
ls_dict=[{'a':1,'b':2},{'a':3,'b':4}]
df4=pd.DataFrame(ls_dict)
df4

   a  b
0  1  2
1  3  4

In [25]:
ls_dict1=[{'a':1,'b':2},{'a':3,'b':4,'c':5}]
df5=pd.DataFrame(ls_dict1)
df5

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [26]:
#DICT_SERIES

In [28]:
dict_sr={'id':pd.Series([1,2,3]),'SN':[111,222,333]}
df6=pd.DataFrame(dict_sr)
df6

   id   SN
0   1  111
1   2  222
2   3  333

In [29]:
df7 = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)
df7

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [31]:
type(df7)

pandas.core.frame.DataFrame

In [33]:
#we can check for single series also
df7["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [34]:
#u can also use matematical function as mini and max to get mini and maxi from series or df
df7["Age"].max()

58

In [36]:
df7["Age"].min()

22

In [37]:
df7.describe

<bound method NDFrame.describe of                        Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female>